[
    {
        "id": "preamble1",
        "desc": [
            "Однажды вы пошли гулять в лес и набрели там на удивительную поляну.",
            "Вся покрытая пышными цветами, она была очень красивой. От сильного запаха цветов и небывалой тишины клонило в сон.",
            "Вы не удержались и уснули…"],
        "next": "preamble2"
    },
    {
        "id": "preamble2",
        "desc": ["Вам снились странные сны — как будто вас куда-то тянет, далеко-далеко, на другой край вселенной.",
            "Несмотря на это, проснулись вы вполне отдохнувшим. Сев и протерев глаза, вы обнаружили, что находитесь на ",
            "очень похожей, но все-таки другой поляне. Вы никогда не видели таких цветов и деревьев."],
        "next": "preamble3"
    },
    {
        "id": "preamble3",
        "desc": "Изрядно поплутав, к вечеру вы вышли на опушку леса, к какой-то явно средневековой деревне. Встретив местного крестьянина, вы обнаружили, что он вас не понимает, однако его язык кажется вам смутно знакомым. Вы голодны; попробуйте попросить у него хлеба.",
        "after": "Крестьянин дал вам хлеба.",
        "validator": "/chleb/i",
        "next": "preamble4",
        "hints": [
            "ch…",
            "ch███",
            "chleb"
        ]
    },
    {
        "id": "preamble4",
        "desc": "Утолив голод, вы почувствовали жажду. Добрый крестьянин наверняка не пожалеет для вас воды.",
        "validator": "/woda/i",
        "next": "preamble5",
        "hints": [
            "w…",
            "w███",
            "woda"
        ]
    },
    {
        "id": "preamble5",
        "desc": "Посмотрев на вас с жалостью (и, пожалуй, опаской), крестьянин показал рукой на колодец чуть вдалеке. [Пойдете пить|village-well] или спросите у него [что-нибудь еще|village-peasant]?",
        "next": "preamble5"
    },
    {
        "id": "village-well",
        "desc": "Добротный колодец из потемневшего от сырости и времени, но все еще крепкого дерева. Вода в нем свежая и вкусная."
    },
    {
        "id": "village-peasant",
        "desc": "Добросердечный крестьянин смотрит на вас сердобольно, и, кажется, считает, что вы немного не в себе."
    }

]